{"id":"14","title":"Release v1.2.0: Pdf and Exoscale","description":["The new release includes PDF verification, basic validation and accessibility checks","We also moved to a new cloud provider."],"slug":"release-v1-2-0","body":"<h3 id=\"pdf-verification\" tabindex=\"-1\">PDF verification <a class=\"invisible md:visible direct-link \" href=\"#pdf-verification\" aria-hidden=\"true\">#</a></h3>\n<p>Verifying PDF documents is rather tricky and cumbersome. That is why  Sitefig Enterprise now includes PDF verification.</p>\n<p>No more searching and double-checking bulky PDf documents; you can rely on Sitefig to validate your PDF documents.</p>\n<p>Existing customers can access PDF audits previously not included in the crawls, and we will add more features in the future.</p>\n<p>The release contains the  following audits:</p>\n<ul>\n<li>Missing language identifier (Matterhorn 1.02 11-001, WCAG success criteria 3.1.1 Language of Page)</li>\n<li>Omitted accessibility permissions</li>\n<li>Verification of tagged PDF documents (Matterhorn 1.02 01, 1WCAG Success criteria 1.3.1 Info and Relationships)</li>\n<li>Missing title  (Matterhorn 1.02 06-003 and 06-004, WCAG Success cirteraia 2.4.2 level A)</li>\n<li>Multiple-page PDF documents must have bookmarks  (WCAG Success criteria:  2.4.1 Bypass Blocks (Level A) 2.4.5 Multiple Ways (Level AA))</li>\n<li>Empty PDf document</li>\n<li>Corrupt Pdf documents</li>\n<li>Broken link check extended to PDF documents.</li>\n</ul>\n<h3 id=\"a-new-cloud-provider%3A-exoscale\" tabindex=\"-1\">A new cloud provider: Exoscale <a class=\"invisible md:visible direct-link \" href=\"#a-new-cloud-provider%3A-exoscale\" aria-hidden=\"true\">#</a></h3>\n<p>Sitefig recently switched to a new provider: Exoscale.</p>\n<p>The choice of the new provider was guided by two issues, cost and GDPR compliance. An added bonus was the fast and accurate customer service from Exoscale and the exceptionally user-friendly portal that allows us to manage the servers.</p>\n<p>Exoscale is fully compliant with GDPR rules and, most importantly, does not fall under the contested PrivacyShield or the Trans-Atlantic Data Privacy Framework.</p>\n<p>All data is stored in the Frankfurt data centre, and the company Exoscale is a registered company in Switzerland.</p>\n<p>The switch also allowed us to improve the crawling speed for multiple customers. All customer crawls now run in complete isolation, improving the performance metrics reporting and time to finish a website crawl and analysis.</p>\n<h3 id=\"what-is-next%3F\" tabindex=\"-1\">What is next? <a class=\"invisible md:visible direct-link \" href=\"#what-is-next%3F\" aria-hidden=\"true\">#</a></h3>\n<p>Due to the move to Exoscale, many features were waiting in the backlog.\nThe next feature that is coming up is audit handling and ticketing support.\n&quot;Ignore&quot; audits and/or tagging audits  for review\nConnecting audits with tickets\nJira integration\nCreating tickets from Sitefig</p>\n<p>Anything you'd like to add?</p>\n<p>If you are an Enterprise customer, please feel free to talk to us and suggest new features.</p>\n","date":"2022-11-10T10:53:35.429Z","tags":["news"],"tag":"news","image":{"url":"http://localhost:1337/uploads/wasp_robot_03_482f4d2cf2.svg","alt":"alt txt"}}